wsdl/fedex/CreatePendingShipmentRequest_Smash_Email_Ret.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://fedex.com/ws/ship/v9">
<SOAP-ENV:Body>
<CreatePendingShipmentRequest>
<WebAuthenticationDetail>
<UserCredential>
<Key></Key>
<Password></Password>
</UserCredential>
</WebAuthenticationDetail>
<ClientDetail>
<AccountNumber></AccountNumber>
<MeterNumber></MeterNumber>
</ClientDetail>
<TransactionDetail>
<CustomerTransactionId>CreatePendingShipmentRequest_Smash_Email_Ret</CustomerTransactionId>
</TransactionDetail>
<Version>
<ServiceId>ship</ServiceId>
<Major>9</Major>
<Intermediate>0</Intermediate>
<Minor>0</Minor>
</Version>
<RequestedShipment>
<ShipTimestamp>2010-08-16T09:30:47-05:00</ShipTimestamp>
<DropoffType>REGULAR_PICKUP</DropoffType>
<ServiceType>SMART_POST</ServiceType>
<PackagingType>YOUR_PACKAGING</PackagingType>
<TotalWeight>
<Units>KG</Units>
<Value>10.0</Value>
</TotalWeight>
<Shipper>
<AccountNumber></AccountNumber>
<Contact>
<PersonName>FEDEX</PersonName>
<Title>FEDEX</Title>
<CompanyName>FedEx-WAPI</CompanyName>
<PhoneNumber>1234567890</PhoneNumber>
</Contact>
<Address>
<StreetLines>String</StreetLines>
<City>Texas</City>
<StateOrProvinceCode>TX</StateOrProvinceCode>
<PostalCode>73301</PostalCode>
<UrbanizationCode>String</UrbanizationCode>
<CountryCode>US</CountryCode>
</Address>
</Shipper>
<Recipient>
<AccountNumber></AccountNumber>
<Contact>
<PersonName>Recipient Contact</PersonName>
<CompanyName>FEDEX</CompanyName>
<PhoneNumber>1234567890</PhoneNumber>
</Contact>
<Address>
<StreetLines>String</StreetLines>
<City>Texas</City>
<StateOrProvinceCode>TN</StateOrProvinceCode>
<PostalCode>38017</PostalCode>
<UrbanizationCode>String</UrbanizationCode>
<CountryCode>US</CountryCode>
</Address>
</Recipient>
<ShippingChargesPayment>
<PaymentType>SENDER</PaymentType>
<Payor>
<AccountNumber></AccountNumber>
<CountryCode>US</CountryCode>
</Payor>
</ShippingChargesPayment>
<SpecialServicesRequested>
<SpecialServiceTypes>RETURN_SHIPMENT</SpecialServiceTypes>
<SpecialServiceTypes>PENDING_SHIPMENT</SpecialServiceTypes>
<ReturnShipmentDetail>
<ReturnType>PENDING</ReturnType>
<Rma>
<Number>15987456320</Number>
<Reason>String</Reason>
</Rma>
<ReturnEMailDetail>
<MerchantPhoneNumber>1234567890</MerchantPhoneNumber>
</ReturnEMailDetail>
</ReturnShipmentDetail>
<PendingShipmentDetail>
<Type>EMAIL</Type>
<ExpirationDate>2010-08-16</ExpirationDate>
<EmailLabelDetail>
<NotificationEMailAddress>vikas_saini@syntelinc.com</NotificationEMailAddress>
<NotificationMessage>shipmentisdonetracpending</NotificationMessage>
</EmailLabelDetail>
</PendingShipmentDetail>
</SpecialServicesRequested>
<SmartPostDetail>
<Indicia>PARCEL_RETURN</Indicia>
<AncillaryEndorsement>ADDRESS_CORRECTION</AncillaryEndorsement>
<HubId>5531</HubId>
</SmartPostDetail>
<LabelSpecification>
<LabelFormatType>COMMON2D</LabelFormatType>
<ImageType>PNG</ImageType>
<LabelStockType>PAPER_4X6</LabelStockType>
</LabelSpecification>
<RateRequestTypes>ACCOUNT</RateRequestTypes>
<PackageCount>1</PackageCount>
<PackageDetail>INDIVIDUAL_PACKAGES</PackageDetail>
<RequestedPackageLineItems>
<SequenceNumber>1</SequenceNumber>
<Weight>
<Units>LB</Units>
<Value>2.0</Value>
</Weight>
<Dimensions>
<Length>6</Length>
<Width>4</Width>
<Height>3</Height>
<Units>IN</Units>
</Dimensions>
<ItemDescription>String</ItemDescription>
<CustomerReferences>
<CustomerReferenceType>CUSTOMER_REFERENCE</CustomerReferenceType>
<Value>String</Value>
</CustomerReferences>
<ContentRecords>
<PartNumber>String</PartNumber>
<ItemNumber>String</ItemNumber>
<ReceivedQuantity>1</ReceivedQuantity>
<Description>String</Description>
</ContentRecords>
</RequestedPackageLineItems>
</RequestedShipment>
</CreatePendingShipmentRequest>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>